app/controllers/admin/categories_controller.rb

  def index
    @search = Category.ransack params[:q]
    @per_page = params[:per_page] || Settings.per_pages.second
    @categories = @search.result.recent.page(params[:page]).per @per_page
---
SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`id` DESC, `categories`.`created_at` DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `categories`

  def create
    @category = Category.new category_params
    if @category.save
---
INSERT INTO `categories` (`code`, `name`, `description`, `created_at`, `updated_at`) VALUES ('dád', 'dsad', 'dsa', '2018-02-06 10:11:08', '2018-02-06 10:11:08')

  def update
    if @category.update_attributes category_params
---
UPDATE `categories` SET `description` = 'sas', `updated_at` = '2018-02-07 02:57:53' WHERE `categories`.`id` = 1

  def destroy
    if @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 5

  def load_category
    @category = Category.find_by id: params[:id]
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1